---
kind: method
id: M:Autodesk.Revit.DB.ProjectLocationSet.ForwardIterator
source: html/9002a9ac-76e1-f7ca-adac-a59f2e1c1ccc.htm
---
# Autodesk.Revit.DB.ProjectLocationSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual ProjectLocationSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.